#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.s3.aws_s3_object.upload_object["assets/certifications/az104.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "f4cff29bbcb26b9af01b30da83f993fa"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/certifications/az104.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/certifications/az104.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/certifications/azure_fundamentals.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "b6da8df6c5a62c422a3109314bb4c37e"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/certifications/azure_fundamentals.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/certifications/azure_fundamentals.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/certifications/cloud_practioner.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "ba37c39350b792469d9cc759a5da3bf6"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/certifications/cloud_practioner.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/certifications/cloud_practioner.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/certifications/developer_associate.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "a9d598ebd215357d6d7c783babe0b079"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/certifications/developer_associate.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/certifications/developer_associate.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/certifications/solutions_architect_associate.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "44bc0a4328d8d2ca940f64ea288fd838"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/certifications/solutions_architect_associate.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/certifications/solutions_architect_associate.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/church.jpeg"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/jpeg"
      + etag                   = "8ab16af4b11e51eb8d0c8f2048bff296"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/church.jpeg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/church.jpeg"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/favicon/about.txt"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/plain; charset=utf-8"
      + etag                   = "ec70ca9bbd0e42b9cd6e425bbc9ce33c"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/favicon/about.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/favicon/about.txt"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/favicon/android-chrome-192x192.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "0eab2062b594b4d7c46c788698fdd792"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/favicon/android-chrome-192x192.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/favicon/android-chrome-192x192.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/favicon/android-chrome-512x512.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "a1d015dd8bc37d3db02019aab313dc53"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/favicon/android-chrome-512x512.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/favicon/android-chrome-512x512.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/favicon/apple-touch-icon.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "656cea95e0db4aa20797e7fe608df9ec"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/favicon/apple-touch-icon.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/favicon/apple-touch-icon.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/favicon/favicon-16x16.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "f39e71664045cb7f0c6488c1d717d50a"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/favicon/favicon-16x16.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/favicon/favicon-16x16.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/favicon/favicon-32x32.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "49d16a2fc14ca62f2c9f97f248b30cb6"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/favicon/favicon-32x32.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/favicon/favicon-32x32.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/favicon/site.webmanifest"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "053100cb84a50d2ae7f5492f7dd7f25e"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/favicon/site.webmanifest"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/favicon/site.webmanifest"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/me.jpg"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/jpeg"
      + etag                   = "2b2da93e77fde721f118a643a8eb6df8"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/me.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/me.jpg"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/national-museum.jpg"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/jpeg"
      + etag                   = "79be98b5b6d34f5dfbfe984c69920caa"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/national-museum.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/national-museum.jpg"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/pexels-photo-13618459.jpeg"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/jpeg"
      + etag                   = "339014d49a6e096c0489dd72e1492496"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/pexels-photo-13618459.jpeg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/pexels-photo-13618459.jpeg"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/resume.pdf"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/pdf"
      + etag                   = "163fc83b3f21d2a8d8f4a65c13b79c73"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/resume.pdf"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/resume.pdf"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/skills/Keras.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "31237f068babf461d8b136122ce3930b"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/skills/Keras.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/skills/Keras.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/skills/angular-logo.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "c6d0bdd020fa4c26a8abfaec75365630"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/skills/angular-logo.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/skills/angular-logo.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/skills/angular.svg"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/svg+xml"
      + etag                   = "be1936ab8ae974217d973bf5612da08a"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/skills/angular.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/skills/angular.svg"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/skills/aws.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "8845b1778eff74b1408fc681c46881aa"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/skills/aws.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/skills/aws.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/skills/c.svg"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/svg+xml"
      + etag                   = "8cc47c68f0d71b364d6e3b793dbb6e55"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/skills/c.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/skills/c.svg"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/skills/cicd.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "569e2c092f14dcc91ad487170022a195"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/skills/cicd.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/skills/cicd.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/skills/css3.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "a0c99024c7260b1a1df8802806ccc3e3"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/skills/css3.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/skills/css3.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/skills/django-logo.svg"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/svg+xml"
      + etag                   = "20c8e0ac9a15bb7d542ea1c8e8cb447c"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/skills/django-logo.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/skills/django-logo.svg"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/skills/docker-compose.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "2ee785d8a603cb93e729cecb1ab9c44a"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/skills/docker-compose.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/skills/docker-compose.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/skills/docker-logo.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "f354a74ca7e5d0523043d9b094d46c67"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/skills/docker-logo.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/skills/docker-logo.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/skills/fastapi.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "7c163253009127bb014a4b15c99fb8e2"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/skills/fastapi.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/skills/fastapi.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/skills/flask.svg"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/svg+xml"
      + etag                   = "d98d769e20541d7388e2771f8bd2a1e0"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/skills/flask.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/skills/flask.svg"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/skills/html.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "d0631a18079243c3b8c52d3db0769162"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/skills/html.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/skills/html.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/skills/javascript.svg"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/svg+xml"
      + etag                   = "181ba95845f6c266949e34f6a07b8d8e"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/skills/javascript.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/skills/javascript.svg"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/skills/mysql.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "d76ff1872d0f758b4739fdd4d27d0cac"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/skills/mysql.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/skills/mysql.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/skills/numpy.svg"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/svg+xml"
      + etag                   = "6810006dc950ca3835732bb84bf3c08a"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/skills/numpy.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/skills/numpy.svg"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/skills/opencv.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "ff683c24e4c7de2a8968536425dbce97"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/skills/opencv.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/skills/opencv.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/skills/postgreSQL.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "842c6c2ecab1de7af21d74c5e406c124"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/skills/postgreSQL.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/skills/postgreSQL.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/skills/python.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "6e6241ce6fb9a0685d81d20500ad3c37"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/skills/python.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/skills/python.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/skills/pytorch.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "07d3d0f7beb77834e097fceb3df284af"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/skills/pytorch.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/skills/pytorch.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/skills/terraform.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "16681d49fd60da03611a321d890d5245"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/skills/terraform.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/skills/terraform.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/sunshine.jpg"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/jpeg"
      + etag                   = "90c1a44a1181b848cbac95e1d42dde51"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/sunshine.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/sunshine.jpg"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/sunshine2.jpg"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/jpeg"
      + etag                   = "ca5079d1731f8073720460fc6da3f72f"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/sunshine2.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/sunshine2.jpg"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/timeline/cert-architect.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "44bc0a4328d8d2ca940f64ea288fd838"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/timeline/cert-architect.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/timeline/cert-architect.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/timeline/cert-azureassociate.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "4c2911c8dd32d7dfad9b651afe5341ca"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/timeline/cert-azureassociate.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/timeline/cert-azureassociate.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/timeline/cert-azurefundamentals.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "1d110b3e5725672ff8e514ff41a97b63"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/timeline/cert-azurefundamentals.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/timeline/cert-azurefundamentals.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/timeline/cert-developer.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "a9d598ebd215357d6d7c783babe0b079"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/timeline/cert-developer.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/timeline/cert-developer.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/timeline/cert-practitioner.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "ba37c39350b792469d9cc759a5da3bf6"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/timeline/cert-practitioner.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/timeline/cert-practitioner.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/timeline/cnpq.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "c889c4b2259086772eddbcfe4abfc00e"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/timeline/cnpq.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/timeline/cnpq.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/timeline/etb.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "337c3038b6b2f41d1c18aaa719f2d8e8"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/timeline/etb.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/timeline/etb.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/timeline/maratona.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "a7397952e49f91a98e82bccc03c2a9a8"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/timeline/maratona.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/timeline/maratona.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/timeline/mat.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "42bd29cd8a608e82661e376986611847"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/timeline/mat.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/timeline/mat.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/timeline/objective.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "841e3a9864b83522fb6334200eaa6a18"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/timeline/objective.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/timeline/objective.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/timeline/pibic.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "744f10016cdaab8b7a4d00088b326c67"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/timeline/pibic.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/timeline/pibic.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/timeline/rm.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "1b6ebd9fa098e49afb7022a6a2c1bd2b"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/timeline/rm.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/timeline/rm.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/timeline/unb.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "ef0500f0d6c86e728ad46ccb034ff28d"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/timeline/unb.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/timeline/unb.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/timeline/unball.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "265a326847a995afd8a0a785de47b206"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/timeline/unball.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/timeline/unball.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/tower1.jpg"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/jpeg"
      + etag                   = "d4759068a7d0aad615de2af71922fe46"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/tower1.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/tower1.jpg"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/tower2.jpg"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/jpeg"
      + etag                   = "0ca163fabb09000e5d39f9231e4f7d23"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/tower2.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/tower2.jpg"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["assets/tower3.jpg"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/jpeg"
      + etag                   = "852a98529b0e8b3a71c18d1dabfa3297"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/tower3.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/assets/tower3.jpg"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["favicon.ico"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/vnd.microsoft.icon"
      + etag                   = "05bcfe9a02b93e1c5a5da14bfda8c41f"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "favicon.ico"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/favicon.ico"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["index.html"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html; charset=utf-8"
      + etag                   = "0ac88c0b97a708435f3ff3920ad35be2"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "index.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/index.html"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["main-5CEAWMEF.js"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "e79fb23ac34cc7661b443ce6f6c4ea01"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "main-5CEAWMEF.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/main-5CEAWMEF.js"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["media/cert-architect-XUFFPUDC.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "44bc0a4328d8d2ca940f64ea288fd838"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "media/cert-architect-XUFFPUDC.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/media/cert-architect-XUFFPUDC.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["media/cert-azureassociate-3Q6ABQLD.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "4c2911c8dd32d7dfad9b651afe5341ca"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "media/cert-azureassociate-3Q6ABQLD.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/media/cert-azureassociate-3Q6ABQLD.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["media/cert-azurefundamentals-6DUMDX5Z.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "1d110b3e5725672ff8e514ff41a97b63"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "media/cert-azurefundamentals-6DUMDX5Z.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/media/cert-azurefundamentals-6DUMDX5Z.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["media/cert-developer-CCAVKXJJ.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "a9d598ebd215357d6d7c783babe0b079"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "media/cert-developer-CCAVKXJJ.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/media/cert-developer-CCAVKXJJ.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["media/cert-practitioner-7B7IERFM.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "ba37c39350b792469d9cc759a5da3bf6"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "media/cert-practitioner-7B7IERFM.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/media/cert-practitioner-7B7IERFM.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["media/cnpq-JVVJX35E.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "c889c4b2259086772eddbcfe4abfc00e"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "media/cnpq-JVVJX35E.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/media/cnpq-JVVJX35E.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["media/etb-PCKZC2BA.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "337c3038b6b2f41d1c18aaa719f2d8e8"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "media/etb-PCKZC2BA.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/media/etb-PCKZC2BA.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["media/maratona-H33HHUO4.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "a7397952e49f91a98e82bccc03c2a9a8"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "media/maratona-H33HHUO4.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/media/maratona-H33HHUO4.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["media/mat-QXJ2XXJH.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "42bd29cd8a608e82661e376986611847"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "media/mat-QXJ2XXJH.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/media/mat-QXJ2XXJH.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["media/national-museum-2DND74PN.jpg"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/jpeg"
      + etag                   = "79be98b5b6d34f5dfbfe984c69920caa"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "media/national-museum-2DND74PN.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/media/national-museum-2DND74PN.jpg"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["media/objective-DC6WOD67.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "841e3a9864b83522fb6334200eaa6a18"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "media/objective-DC6WOD67.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/media/objective-DC6WOD67.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["media/pibic-RMK4CGJN.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "744f10016cdaab8b7a4d00088b326c67"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "media/pibic-RMK4CGJN.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/media/pibic-RMK4CGJN.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["media/rm-TI45RJ7D.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "1b6ebd9fa098e49afb7022a6a2c1bd2b"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "media/rm-TI45RJ7D.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/media/rm-TI45RJ7D.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["media/tower3-B766DD7J.jpg"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/jpeg"
      + etag                   = "852a98529b0e8b3a71c18d1dabfa3297"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "media/tower3-B766DD7J.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/media/tower3-B766DD7J.jpg"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["media/unb-RWICGQT7.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "ef0500f0d6c86e728ad46ccb034ff28d"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "media/unb-RWICGQT7.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/media/unb-RWICGQT7.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["media/unball-75HTCGVB.png"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "265a326847a995afd8a0a785de47b206"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "media/unball-75HTCGVB.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/media/unball-75HTCGVB.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["polyfills-RT5I6R6G.js"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "d5cf8a5f8686af22ff6f8c88e0281484"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "polyfills-RT5I6R6G.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/polyfills-RT5I6R6G.js"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

  # module.s3.aws_s3_object.upload_object["styles-UTFUFYZA.css"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/css; charset=utf-8"
      + etag                   = "beeabe9d633233621ef8af641e4c8340"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "styles-UTFUFYZA.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/styles-UTFUFYZA.css"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

Plan: 78 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ fileset-results = [
      + "favicon.ico",
      + "index.html",
      + "main-5CEAWMEF.js",
      + "polyfills-RT5I6R6G.js",
      + "styles-UTFUFYZA.css",
    ]
```

</details>

*Pusher: @hiagop22, Action: `pull_request`, Workflow: `Terraform Plan`*